mztulip/CH32X033_examples/examples_x033/usbfs_cdc_printf/main.c
#include "ch32fun.h"
#include <stdio.h>
#include <string.h>
#include "fsusb.h"

#define UART_TX_PIN PA2
#define UART_RX_PIN PA3
#include "cdc.h"

// sudo python chprog.py usbfs_cdc_uart.bin


#if defined( FUNCONF_SYSTICK_USE_HCLK ) && FUNCONF_SYSTICK_USE_HCLK && !defined(CH32V10x)
#define SYSTICK_DIV 1
#else
#define SYSTICK_DIV 8
#endif
#if !defined(CH32V10x) && !defined (CH32X03x)
volatile uint32_t millis_cnt = 0;
#else
volatile uint64_t millis_cnt = 0;
#endif
volatile char terminal_input;
// extern volatile uint8_t usb_debug;
extern volatile uint8_t uart_debug;


int HandleInRequest( struct _USBState * ctx, int endp, uint8_t * data, int len )
{
	int ret = 0;  // Just NAK
	// if (usb_debug) printf("HandleInRequest - EP%d\n", endp);
	switch (endp)
	{
		case 1:
			// ret = -1; // Just ACK
			break;
		case 3:
			cdc.rxing = 0;
			// ret = -1; // ACK, without it RX was stuck in some cases, leaving for now as a reminder
			break;
	}
	return ret;
}

void HandleDataOut( struct _USBState * ctx, int endp, uint8_t * data, int len )
{
	// if (usb_debug) printf("HandleDataOut - EP%d\n", endp);
	if( endp == 0 )
	{
		ctx->USBFS_SetupReqLen = 0; // To ACK
		if( ctx->USBFS_SetupReqCode == CDC_SET_LINE_CODING )
		{
			// if (usb_debug) printf("CDC_SET_LINE_CODING\n");
			/* Save relevant parameters such as serial port baud rate */
			/* The downlinked data is processed in the endpoint 0 OUT packet, the 7 bytes of the downlink are, in order
				4 bytes: baud rate value: lowest baud rate byte, next lowest baud rate byte, next highest baud rate byte, highest baud rate byte.
				1 byte: number of stop bits (0: 1 stop bit; 1: 1.5 stop bit; 2: 2 stop bits).
				1 byte: number of parity bits (0: None; 1: Odd; 2: Even; 3: Mark; 4: Space).
				1 byte: number of data bits (5,6,7,8,16); */

			// cdc.cdc_cfg[0] = CTRL0BUFF[0];
			// cdc.cdc_cfg[1] = CTRL0BUFF[1];
			// cdc.cdc_cfg[2] = CTRL0BUFF[2];
			// cdc.cdc_cfg[3] = CTRL0BUFF[3];
			// cdc.cdc_cfg[4] = CTRL0BUFF[4];
			// cdc.cdc_cfg[5] = CTRL0BUFF[5];
			// cdc.cdc_cfg[6] = CTRL0BUFF[6];
			// uint32_t baud = CTRL0BUFF[0];
			// baud += ((uint32_t)CTRL0BUFF[1] << 8);
			// baud += ((uint32_t)CTRL0BUFF[2] << 16);
			// baud += ((uint32_t)CTRL0BUFF[3] << 24);
			// cdc.uart->baud = baud;
			// cdc.uart->stop_bits = CTRL0BUFF[4];
			// cdc.uart->parity = CTRL0BUFF[5];
			// cdc.uart->word_length = CTRL0BUFF[6];
		}
	}
	if( endp == 2 )
	{
		if( cdc.tx_stop )
		{
			cdc.tx_stop = 0;
			return;
		}
		// printf("uart_tx_buffer: 0=%c, 1=%c, 2=%c, 3=%c\n", uart_tx_buffer[uart.tx_pos], uart_tx_buffer[uart.tx_pos + 1], uart_tx_buffer[uart.tx_pos + 2], uart_tx_buffer[uart.tx_pos + 3]);
		int pad = 4 - USBFS->RX_LEN;
		if( pad < 0 ) pad = 0;
		uint32_t write_pos = cdc.tx_pos + cdc.tx_remain + USBFS->RX_LEN;
		if( write_pos > cdc.tx_wrap_pos ) write_pos -= cdc.tx_wrap_pos;
		if( write_pos & 0x3 )
		{
			write_pos = (write_pos + 4) & ~0x3;
			USBFS_SendNAK( 2, 0 );
			// USBFS->UEP2_RX_CTRL &= ~USBFS_UEP_R_RES_MASK;
			// USBFS->UEP2_RX_CTRL |= USBFS_UEP_R_RES_NAK;
			cdc.tx_stop = 1;
		}
		// printf("[HandleDatOut] write_pos = %d, tx_pos = %d, tx_remain = %d, USBFS->RX_LEN = %d \n", write_pos, cdc.tx_pos, cdc.tx_remain, USBFS->RX_LEN);
		// if( write_pos >= uart.tx_wrap_pos) write_pos = uart.tx_remain - (uart.tx_wrap_pos - uart.tx_pos);
		// if( write_pos < uart.tx_pos && write_pos + 64 >= uart.tx_pos ) goto buffer_overflow;
		if( write_pos > ( UART_TX_BUF_SIZE - 64) )
		{
			// printf("WRAP -> write_pos = %d > 960, 961 = %c\n", write_pos, uart_tx_buffer[961]);
			cdc.tx_wrap_pos = cdc.tx_pos + cdc.tx_remain + USBFS->RX_LEN;
			write_pos = 0;
		}
		
		// if( write_pos + len > UART_TX_BUF_SIZE - 1 )
		// {
		//   uart.tx_wrap_pos = write_pos;
		//   write_pos = 0;
		// }
		USBFS->UEP2_DMA = (uint32_t)(uart_tx_buffer + write_pos);
		// printf("USBFS->UEP2_DMA = %08x\n", USBFS->UEP2_DMA);
		
		if( cdc.tx_remain >= ( UART_TX_BUF_SIZE ) )
		{
			// if( usb_debug ) printf("Buffer overflow, %c\n", uart_tx_buffer[961]);
			USBFS_SendNAK( 2, 0 );
			// USBFS->UEP2_RX_CTRL &= ~USBFS_UEP_R_RES_MASK;
			// USBFS->UEP2_RX_CTRL |= USBFS_UEP_R_RES_NAK;
			cdc.tx_stop = 1;
		}
		cdc.tx_remain += USBFS->RX_LEN;
		// uart.tx_pos += USBFS->RX_LEN;
		// printf("write_pos = %d, tx_wrap_pos = %d, tx_remain = %d, txing = %d\n", write_pos, cdc.tx_wrap_pos, cdc.tx_remain, cdc.txing);
		// Prevent overwrite of the buffer
		
		// printf("\n");
		// printf("UART_TX_DMA->MADDR = %08x\n", UART_TX_DMA->MADDR);
	}
}

int HandleSetupCustom( struct _USBState * ctx, int setup_code)
{
	int ret = -1;
	if( ctx->USBFS_SetupReqType & USB_REQ_TYP_CLASS )
	{
		switch( setup_code )
		{
			case CDC_SET_LINE_CODING:
			case CDC_SET_LINE_CTLSTE:
			case CDC_SEND_BREAK:
				ret = (ctx->USBFS_SetupReqLen)?ctx->USBFS_SetupReqLen:-1;

				break;
			case CDC_GET_LINE_CODING:
				ctx->pCtrlPayloadPtr = cdc.cdc_cfg;
				ret = ctx->USBFS_SetupReqLen;
				break;

			default:
				ret = 0;
				break;
		}
	}
	else if( ctx->USBFS_SetupReqType & USB_REQ_TYP_VENDOR )
	{
		/* Manufacturer request */
	}
	else
	{
		ret = 0; // Go to STALL
	}
	return ret;
}

void systick_init(void)
{

	SysTick->CTLR = 0;
#ifndef CH32V10x
	SysTick->CMP = DELAY_MS_TIME - 1;
	SysTick->CNT = 0;
	SysTick->CTLR |= SYSTICK_CTLR_STE |  // Enable Counter
                  SYSTICK_CTLR_STIE |  // Enable Interrupts
#if SYSTICK_DIV==1
                  SYSTICK_CTLR_STCLK;  // Set Clock Source to HCLK/1
#else
                  0                 ;
#endif
#else
	uint64_t cmp_tmp = DELAY_MS_TIME - 1;
	// In CH32V103 we can write systick regs only in 8bit manner
	SysTick->CMP0 = (uint8_t)cmp_tmp;
	SysTick->CMP1 = (uint8_t)(cmp_tmp >> 8);
	SysTick->CMP2 = (uint8_t)(cmp_tmp >> 16);
	SysTick->CMP3 = (uint8_t)(cmp_tmp >> 24);
	SysTick->CMP4 = (uint8_t)(cmp_tmp >> 32);
	SysTick->CMP5 = (uint8_t)(cmp_tmp >> 40);
	SysTick->CMP6 = (uint8_t)(cmp_tmp >> 48);
	SysTick->CMP7 = (uint8_t)(cmp_tmp >> 56);

	SysTick->CNT0 = 0;
	SysTick->CNT1 = 0;
	SysTick->CNT2 = 0;
	SysTick->CNT3 = 0;
	SysTick->CNT4 = 0;
	SysTick->CNT5 = 0;
	SysTick->CNT6 = 0;
	SysTick->CNT7 = 0;

	SysTick->CTLR = 1;
#endif
	
	cdc.rx_timeout = 0;
	cdc.usb_timeout = 0;
	millis_cnt = 0;

	NVIC_EnableIRQ(SysTick_IRQn);
}

void SysTick_Handler(void) __attribute__((interrupt));
void SysTick_Handler(void)
{
#ifndef CH32V10x
	SysTick->CMP += DELAY_MS_TIME;
	SysTick->SR = 0;
#else
	uint64_t cmp_tmp = SysTick->CMP + DELAY_MS_TIME;
	
	SysTick->CMP0 = (uint8_t)cmp_tmp;
	SysTick->CMP1 = (uint8_t)(cmp_tmp >> 8);
	SysTick->CMP2 = (uint8_t)(cmp_tmp >> 16);
	SysTick->CMP3 = (uint8_t)(cmp_tmp >> 24);
	SysTick->CMP4 = (uint8_t)(cmp_tmp >> 32);
	SysTick->CMP5 = (uint8_t)(cmp_tmp >> 40);
	SysTick->CMP6 = (uint8_t)(cmp_tmp >> 48);
	SysTick->CMP7 = (uint8_t)(cmp_tmp >> 56);
#endif
	cdc.rx_timeout++;
	cdc.usb_timeout++;
	millis_cnt++;
}

void write_cdc(const uint8_t* data, size_t len)
{
	//Ta implementacja bazuje na buforze kołowym takim skopanym troche
	// dokładamy tylko do maks napełnienia bufora,
	//
	//potem danych nie dodajemy. Jak całośc zostanie wysłana to bufor leci od początku
	NVIC_DisableIRQ(USB_IRQn);
	if((len+cdc.rx_remain) < UART_RX_BUF_SIZE)
	{
		
		uint8_t *buf_empty_part = (uint8_t*)(uart_rx_buffer + cdc.rx_pos+cdc.rx_remain);
		cdc.rx_remain += len;
		cdc.rx_timeout = 0;
		memcpy(buf_empty_part, data, len);
		
	}
	NVIC_EnableIRQ(USB_IRQn);
}

// int puts(const char *s)
// {
// 	size_t sl = strlen( s );
// 	write_cdc((uint8_t*)s, sl);
// 	write_cdc((uint8_t*)"\n", 1 );
// 	return sl+1;
// }

static int __puts_cdc( char *s, int len, void *buf )
{
	(void)buf;//To zawiera wskaźnika na oryginalny string z printf

	write_cdc((uint8_t*)s, len);
	return len;
}

int printf( const char* format, ... )
{
	va_list args;
	va_start( args, format );
	int ret_status = mini_vpprintf(__puts_cdc, 0, format, args);
	va_end( args );
	return ret_status;
}

int main()
{
	SystemInit();
	systick_init();

	funGpioInitAll();
	RCC->AHBPCENR = RCC_AHBPeriph_SRAM | RCC_AHBPeriph_DMA1;

	cdc_init(&cdc);
	USBFSSetup();


	UEP_DMA(2) = (uintptr_t)uart_tx_buffer;

	int last_delay = millis_cnt;
	funPinMode( PA9,     GPIO_CFGLR_OUT_10Mhz_PP ); // Set PIN_1 to output
	int state_led = 0;

	int counter = 0;

	while(1)
	{
		if((millis_cnt - last_delay) > 1000)
		{
			last_delay = millis_cnt;
			// GPIO_InverseBits(1);
			if (state_led == 0)
			{
				state_led = 1;
				funDigitalWrite( PA9,     FUN_HIGH );
			}
			else
			{
				state_led = 0;
				funDigitalWrite( PA9,     FUN_LOW );
			}

			printf("hellos%d\n", counter);
			// counter++;
		}

		
		cdc_process_tx(&cdc);
		cdc_process_rx(&cdc);
	}
}

